In [32]:
import pandas as pd

In [56]:
import MySQLdb as db
from pandas import DataFrame
#from pandas.io.sql import frame_query

database = db.connect('localhost','root','','engage_v1')
#data     = frame_query("SELECT * FROM ass_v1_360_invite_response", database)

In [57]:
database.autocommit=False

In [58]:
database.autocommit

False

In [59]:
mgr = pd.read_sql_query(sql="""SELECT MANAGER_ID, MANAGER_EMP_ID, NAME, EMAIL_ID, GEN_DATE, PASSWORD, LEVEL 
FROM engage_v1.survey_manager;
""",con=database)

In [60]:
mgr.sort_values('MANAGER_ID').tail()

,MANAGER_ID,MANAGER_EMP_ID,NAME,EMAIL_ID,GEN_DATE,PASSWORD,LEVEL
785,159868,17964,Siba Ram Mohanty,Siba Ram Mohanty,2016-09-01 12:34:36,569753,M6-S11
786,159869,25748,Utkarsh Gupta,Utkarsh Gupta,2016-09-01 12:34:36,935989,M6-S12
787,159870,12070,Sreekanth Purushothama Pai,Sreekanth Purushothama Pai,2016-09-01 12:34:36,582372,M5-S9
788,159871,8897,Sangeet Kumar,Sangeet Kumar,2016-09-01 12:34:36,797116,M6-S12
789,159872,11489,Keshava Murthy T V,Keshava Murthy T V,2016-10-20 03:00:00,None,M5-S9

In [128]:
dir = "C:\Users\BNSPL-2\Google Drive\PROJECT DOCUMENTS\GMR Engage Survey\GMR MASTER DATA"
rawdata = pd.read_excel(dir+"\EE Survey Master.xlsx",sheetname="Sheet1")

In [135]:
rawdata.head()

,EMP_ID,Emp Name,JRL,Department,Function,Business,Sector,DOJ,Age,Location,...,4th Level Mgr Name,4th Level Mgr JRL.1,5th Level Mgr Pernr,5th Level Mgr Name,6th Level Mgr JRL,6th Level Mgr Name,6th Level Mgr Level,7th Level Mgr JRL,7th Level Mgr Name,7th Level Mgr JRL.1
0,24762,R R V v n e Prasadraju Patsamatla,M6-S12,Finance & Accounts,Finance & Accounts,Energy,Energy,2015-09-30,35,VPGL-Rajamundry-Andhra,...,Mallikarjuna Rao Grandhi,GH,0.0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,24734,Ramachandra S Mallavarapu,A2,Talent Acquisition,Human Resources,SSC,Corporate,2015-09-30,24,SSC-BLR-Karnataka,...,P M Kumar,GH,1.0,Mallikarjuna Rao Grandhi,0.0,0,0,NaN,NaN,NaN
2,24770,Rahul Sharma,M7-S14,Trainees - O&M,Operations & Maintenance,Energy,Energy,2015-09-30,25,Warora,...,Ramesh R Pai,M2,1538.0,Sanjay Narayan Barde,2.0,Gbs Raju,GH,1.0,Mallikarjuna Rao Grandhi,GH
3,24945,Ashok Sharma,M6-S12,Corporate Relations,Corporate Relations,Construction,Transportation & UI,2015-09-30,38,Fathepur,...,Bangaru Raju,M1,8.0,B V Nageswara Rao,1.0,Mallikarjuna Rao Grandhi,GH,0.0,0,0
4,24771,Virendra Kumar Sah,A2,Chemistry,Operations & Maintenance,Energy,Energy,2015-09-30,30,Warora,...,Sanjay Narayan Barde,M1,2.0,Gbs Raju,1.0,Mallikarjuna Rao Grandhi,GH,0.0,0,0

In [136]:
rawdata.drop(['Emp Name', 'JRL', 'Department', 'Function', 'Business',
       'Sector', 'DOJ', 'Age', 'Location', 'GMR Exp', 'Total Exp',
       'Email', 'R-11-12', 'R-12-13', 'R-13-14', 'R-14-15', 'Mgr Pernr',
       'Mgr Name', 'Mgr JRL',  '2nd Level Pernr', '2nd Level Mgr Name',
       '2nd Level Mgr JRL', '3rd Level Mgr JRL', '3rd Level Mgr Name',
       '3rd Level Mgr Level', '4th Level Mgr JRL', '4th Level Mgr Name',
       '4th Level Mgr JRL.1', '5th Level Mgr Pernr', '5th Level Mgr Name',
       '6th Level Mgr JRL', '6th Level Mgr Name', '6th Level Mgr Level',
       '7th Level Mgr JRL', '7th Level Mgr Name', '7th Level Mgr JRL.1'],axis=1,inplace=True)

In [137]:
rawdata.head()

   EMP_ID  MANAGER_EMP_ID                         NAME   LEVEL
0   24762          1993.0                Arunendu Saha      M2
1   24734          5146.0                    Indrani B  M6-S11
2   24770         10611.0           Akash Kumar Saxena   M5-S9
3   24945         12894.0            Chandra Pal Mehta      M4
4   24771         14345.0  Bharat Ramchandra Pinjarkar   M5-S9

In [138]:
rawdata.rename(columns={'Reviewer Name':'NAME','Reviewer JRL':'LEVEL','Reviewer Pernr':'MANAGER_EMP_ID','Pernr':'EMP_ID'}, inplace=True)

In [139]:
rawdata.head()

   EMP_ID  MANAGER_EMP_ID                         NAME   LEVEL
0   24762          1993.0                Arunendu Saha      M2
1   24734          5146.0                    Indrani B  M6-S11
2   24770         10611.0           Akash Kumar Saxena   M5-S9
3   24945         12894.0            Chandra Pal Mehta      M4
4   24771         14345.0  Bharat Ramchandra Pinjarkar   M5-S9

In [140]:
rawdata[rawdata.MANAGER_EMP_ID == 6005.0]

      EMP_ID  MANAGER_EMP_ID                 NAME  LEVEL
647    21274          6005.0  Venkat Raman Akella  M5-S9
851    20073          6005.0  Venkat Raman Akella  M5-S9
1277   15055          6005.0  Venkat Raman Akella  M5-S9
1317   14427          6005.0  Venkat Raman Akella  M5-S9
1590   12363          6005.0  Venkat Raman Akella  M5-S9
2494    6066          6005.0  Venkat Raman Akella  M5-S9
2900    4031          6005.0  Venkat Raman Akella  M5-S9
2915    3979          6005.0  Venkat Raman Akella  M5-S9
2945    3796          6005.0  Venkat Raman Akella  M5-S9
3632   24868          6005.0  Venkat Raman Akella  M5-S9

In [141]:
rawdata.sort_values('MANAGER_EMP_ID').head()

      EMP_ID  MANAGER_EMP_ID                      NAME LEVEL
2966    3694             1.0  Mallikarjuna Rao Grandhi    GH
3342    1935             1.0  Mallikarjuna Rao Grandhi    GH
2016    9385             1.0  Mallikarjuna Rao Grandhi    GH
3348    1857             1.0  Mallikarjuna Rao Grandhi    GH
3351    1859             1.0  Mallikarjuna Rao Grandhi    GH

In [142]:
rawdata.drop_duplicates().sort_values('MANAGER_EMP_ID').head()

      EMP_ID  MANAGER_EMP_ID                      NAME LEVEL
2966    3694             1.0  Mallikarjuna Rao Grandhi    GH
3342    1935             1.0  Mallikarjuna Rao Grandhi    GH
2016    9385             1.0  Mallikarjuna Rao Grandhi    GH
3348    1857             1.0  Mallikarjuna Rao Grandhi    GH
3351    1859             1.0  Mallikarjuna Rao Grandhi    GH

In [143]:
raw_no_dup = rawdata.drop_duplicates().sort_values('MANAGER_EMP_ID')

In [173]:
raw_no_dup.head()
raw_no_dup[raw_no_dup.MANAGER_EMP_ID == 6005.0]

      EMP_ID  MANAGER_EMP_ID                 NAME  LEVEL
2945    3796          6005.0  Venkat Raman Akella  M5-S9
3632   24868          6005.0  Venkat Raman Akella  M5-S9
1277   15055          6005.0  Venkat Raman Akella  M5-S9
1590   12363          6005.0  Venkat Raman Akella  M5-S9
647    21274          6005.0  Venkat Raman Akella  M5-S9
2900    4031          6005.0  Venkat Raman Akella  M5-S9
2494    6066          6005.0  Venkat Raman Akella  M5-S9
2915    3979          6005.0  Venkat Raman Akella  M5-S9
851    20073          6005.0  Venkat Raman Akella  M5-S9
1317   14427          6005.0  Venkat Raman Akella  M5-S9

In [146]:
mgr['MANAGER_EMP_ID'] = mgr.MANAGER_EMP_ID.astype('float64')

In [160]:
mgr.head()

,MANAGER_ID,MANAGER_EMP_ID,NAME,EMAIL_ID,GEN_DATE,PASSWORD,LEVEL
0,159083,1405.0,Ashis Basu,Ashis Basu,2016-09-01 12:34:36,626399,M1
1,159084,1403.0,Neere Vishwanath Shetty,Neere Vishwanath Shetty,2016-09-01 12:34:36,198468,M2
2,159085,1402.0,Arun Kumar,Arun Kumar,2016-09-01 12:34:36,223568,M5-S9
3,159086,10981.0,Kumar M,Kumar M,2016-09-01 12:34:36,491162,M6-S11
4,159087,1406.0,Subba Rao G,Subba Rao G,2016-09-01 12:34:36,591469,M1

In [170]:
#revmgr = pd.merge(raw_no_dup,mgr,on="MANAGER_EMP_ID")

In [175]:
#revmgr.head()
#revmgr = mgr[mgr.MANAGER_EMP_ID.isin(raw_no_dup.MANAGER_EMP_ID) == False].head()
#revmgr.drop(['NAME','EMAIL_ID','GEN_DATE','PASSWORD','LEVEL'],axis=1,inplace=True)

In [176]:
#revmgr.head()
#revmgr.MANAGER_EMP_ID.dtype
#revmgr[revmgr.MANAGER_EMP_ID == 6005]

Empty DataFrame
Columns: [MANAGER_ID, MANAGER_EMP_ID, NAME, EMAIL_ID, GEN_DATE, PASSWORD, LEVEL]
Index: []

In [178]:
mgr_join = pd.merge(mgr,raw_no_dup,on="MANAGER_EMP_ID")
mgr_join.head()
mgr_join.drop(['NAME_x','EMAIL_ID','GEN_DATE','PASSWORD','LEVEL_x','NAME_y','LEVEL_y'],axis=1,inplace=True)
mgr_join = mgr_join.drop_duplicates()
mgr_join.head()

   MANAGER_ID  MANAGER_EMP_ID  EMP_ID
0      159083          1405.0   20978
1      159083          1405.0   12713
2      159083          1405.0   21942
3      159083          1405.0   15495
4      159083          1405.0   11122

In [179]:
userpern = pd.read_sql_query(sql="""SELECT survey_v1_user_servey_def.USD_ID,
       user_info.EMP_ID,
       user_info.email,
       user_info.name
  FROM engage_v1.survey_v1_user_servey_def
       JOIN all_survey_v1_user_client_mapper_view
          ON all_survey_v1_user_client_mapper_view.UCM_ID =
                survey_v1_user_servey_def.UCM_ID
       JOIN user_info
          ON user_info.USER_ID =
                all_survey_v1_user_client_mapper_view.USER_ID
 WHERE SURVEY_DEF_ID = 12;
""",con=database)

In [180]:
userpern.head()

   USD_ID EMP_ID                       email               name
0     208   6356     VIKAS.SINHA@GMRGROUP.IN  Vikas Kumar Sinha
1     209  19373  PREETIKA.NAIDU@GMRGROUP.IN     Preetika Naidu
2     210   3657     AMIT.KUMAR2@GMRGROUP.IN         Amit Kumar
3     211   6127        ARUN.ROY@GMRGROUP.IN   Arun Prakash Roy
4     212  21618          NITISH@GMRGROUP.IN         Nitish ...

In [181]:
mgr_join.MANAGER_EMP_ID.dtype

dtype('float64')

In [182]:
userpern['EMP_ID'] = userpern.EMP_ID.astype('int64')

In [183]:
joindata = pd.merge(userpern,mgr_join,on="EMP_ID")

In [184]:
joindata.drop(['email','name'],axis=1,inplace=True)
joindata.head()

   USD_ID  EMP_ID  MANAGER_ID  MANAGER_EMP_ID
0     208    6356      159286         18559.0
1     209   19373      159689          1741.0
2     210    3657      159572          2212.0
3     211    6127      159370         18041.0
4     212   21618      159624          1789.0

In [185]:
joindata.rename(columns={'USD_ID':'SUSD_ID'},inplace=True)

In [186]:
#joindata.drop(['EMP_ID'],axis=1,inplace=True)
joindata.sort_values('SUSD_ID').head()

   SUSD_ID  EMP_ID  MANAGER_ID  MANAGER_EMP_ID
0      208    6356      159286         18559.0
1      209   19373      159689          1741.0
2      210    3657      159572          2212.0
3      211    6127      159370         18041.0
4      212   21618      159624          1789.0

In [190]:
joindata['MANAGER_LEVEL'] = 99
#joindata.drop(['MANAGER_EMP_ID'],axis=1,inplace=True)
joindata.head()

   SUSD_ID  EMP_ID  MANAGER_ID  MANAGER_EMP_ID  MANAGER_LEVEL
0      208    6356      159286         18559.0             99
1      209   19373      159689          1741.0             99
2      210    3657      159572          2212.0             99
3      211    6127      159370         18041.0             99
4      212   21618      159624          1789.0             99

In [191]:
#joindata[joindata.MANAGER_EMP_ID==6005.0]
joindata.MANAGER_EMP_ID.count()

3623

In [192]:
dir = "C:\Users\BNSPL-2\Google Drive\PROJECT DOCUMENTS\GMR Engage Survey\GMR MASTER DATA"
joindata.to_excel(dir+"\Reviewer_upload.xlsx",sheet_name="Review")